amitn/knobcaster/sdkconfig.defaults
# ESP-IDF default config for the ESP32-S3 Knob Cast controller.
# PlatformIO seeds the generated sdkconfig from this file. Edit here (not the
# generated sdkconfig.*) so the config is reproducible.

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB ---
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 8 MB OCTAL (S3R8) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384

# --- CPU ---
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# --- FreeRTOS: 1 kHz tick (1 ms) for fine scheduling. At the 100 Hz default a
# 4 ms encoder poll (pdMS_TO_TICKS(4)) truncates to 0 ticks and busy-spins,
# starving the network task and tripping the task watchdog. ---
CONFIG_FREERTOS_HZ=1000

# --- USB Serial/JTAG console (logs over native USB) ---
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- TLS: Cast devices use self-signed certs; we connect without CA verify. ---
# IDF 6.0 esp-tls refuses to connect with no verification option unless these
# insecure opt-ins are set (then it uses MBEDTLS_SSL_VERIFY_NONE). Required for
# the Cast control channel.
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
# Route mbedTLS allocations through the default heap so the big SSL buffers can
# land in PSRAM (small/DMA allocs stay internal via SPIRAM_MALLOC_ALWAYSINTERNAL).
# Without this, the warm pool's ~3 Cast TLS sessions + the album-art fetch exhaust
# internal RAM and ssl_setup fails with MBEDTLS_ERR_SSL_ALLOC_FAILED (-0x008D).
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
# NOTE: do NOT enable CONFIG_MBEDTLS_DYNAMIC_BUFFER — it reallocates the RX buffer
# between TLS records and breaks large multi-record HTTPS bodies (the ~130KB album
# art) with MBEDTLS_ERR_SSL_BAD_INPUT_DATA (-0x0087). Buffers live in PSRAM now, so
# the memory it saved isn't needed.

# --- mDNS / lwIP ---
CONFIG_LWIP_IPV4=y

# --- Main task stack (LVGL + app init) ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- LVGL: enable the QR code widget (Wi-Fi provisioning screen) ---
CONFIG_LV_USE_QRCODE=y
# --- LVGL: Tiny-TTF renders an embedded TTF at runtime (Hebrew/Unicode song
# titles; default Montserrat is Latin-only) + bidi for RTL (Hebrew) ordering. ---
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_USE_BIDI=y
# --- LVGL: enable lv_snapshot (serial framebuffer dump, `just shot`) ---
CONFIG_LV_USE_SNAPSHOT=y
# Use the C-stdlib allocator (ESP heap, large allocs -> PSRAM) instead of LVGL's
# 64 KB builtin pool, so a full-screen (360x360x2 = 259 KB) snapshot can allocate.
# CONFIG_LV_USE_BUILTIN_MALLOC is not set
CONFIG_LV_USE_CLIB_MALLOC=y

# --- Compiler ---
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
